FROM wiremock/wiremock:latest

# Переключаемся на root, чтобы точно иметь права на создание папок
USER root

# Копируем всё содержимое проекта
COPY . /home/wiremock/

# Просто создаем папки. Если они уже есть (скопировались), -p не выдаст ошибку.
# Если их нет (не были в Git), они создадутся.
RUN mkdir -p /home/wiremock/mappings /home/wiremock/__files

# Возвращаемся к стандартному поведению образа (обычно это запуск wiremock)
# Не указываем конкретного пользователя, чтобы не гадать с именем
EXPOSE 8080